# -*- eval: (org-babel-lob-ingest "./ob-haskell-common.org"); -*-

#+TITLE: Building Projects

#+PROPERTY: header-args:haskell :results replace output
#+PROPERTY: header-args:haskell+ :noweb yes
#+PROPERTY: header-args:haskell+ :wrap EXAMPLE
#+PROPERTY: header-args:haskell+ :epilogue ":load"
#+PROPERTY: header-args:haskell+ :post ghci-clean(content=*this*)

* 13.10 Step One: importing modules
Import what you will need

#+BEGIN_SRC haskell :eval never
module Main where

import Control.Monad (forever) -- [1]
import Data.Char (toLower) -- [2]
import Data.Maybe (isJust) -- [3]
import Data.List (intersperse) -- [4]
import System.Exit (exitSuccess) -- [5]
import System.Random (randomRIO) -- [6]
#+END_SRC

1. To make an infinite loop
2. To get a lowercase version of a ~Char~
3. To tell if some ~Maybe a~ is ~Just a~ or not
4. To intersperse a value in a list, in this case to intersperse ~' '~
   between characters of a ~String~
5. To exit successfully from our program
6. To get a random value
   #+BEGIN_SRC haskell
   import System.Random

   :t randomRIO
   randomRIO (5, 10)
   randomRIO (1, 100)
   randomRIO (1, 100)
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   randomRIO :: Random a => (a, a) -> IO a
   7
   66
   99
   #+END_EXAMPLE

** Modifying Code

1. Open your Ciphers module and modify it so that the Caesar and
   Vigenère ciphers work with user input.

   #+BEGIN_SRC haskell :eval never
   main :: IO ()
   main = do
     hSetBuffering stdout NoBuffering
     let alphabet = "abcdefghjkilmnopqrstuvwxyz"
     putStr "Choose a cipher (Vigenere|Caesar): "
     cipher <- getLine
     case cipher of
       "Vigenere" -> do
         putStr "Choose a keyword: "
         keyword <- getLine
         putStr "Write a message to encode: "
         message <- getLine
         putStrLn $ vigenereEncode alphabet keyword message
       "Caesar" -> do
         putStr "Choose a number: "
         maybeShift <- getLine
         return ()
         case readMaybe maybeShift :: Maybe Int of
           (Just shift) -> do
             putStr "Write a message to encode: "
             message <- getLine
             putStrLn $ caesarEncode alphabet shift message
           Nothing -> do
             putStrLn $ "`" ++ maybeShift ++ "` is not a number"
       _ -> do
         putStrLn $ "`" ++ cipher ++ "` is not a valid cipher"
   #+END_SRC

2. Here is a very simple, short block of code. Notice it has a forever
   that will make it keep running, over and over again. Load it into
   your REPL and test it out. Then refer back to the chapter and
   modify it to exit successfully after a False result.

   #+BEGIN_SRC haskell :eval never
   import Control.Monad

   palindrome :: IO ()
   palindrome = forever $ do
     line1 <- getLine
     case (line1 == reverse line1) of
     True ->
       putStrLn "It's a palindrome!"
     False ->
       putStrLn "Nope!"
   #+END_SRC

   #+BEGIN_SRC haskell
   import Control.Monad
   import System.Exit (exitSuccess)

   palindrome :: IO ()
   palindrome = forever $ do
     line1 <- getLine
     case (line1 == reverse line1) of
     True ->
       putStrLn "It's a palindrome!"
     False -> do
       putStrLn "Nope!"
       exitSuccess
   #+END_SRC

3. Make ~palindrome~ to work on sentences like "Madam I’m Adam,"

   The solution is [[./chapter-013/Palindrome.hs][here]]
   #+BEGIN_SRC haskell
   <<add-current-chapter-directory-in-path()>>
   :load Palindrome

   isPalindrome "Madam I'm Adam,"
   isPalindrome "Not a palindrome for sure"
   #+END_SRC

   #+RESULTS:
   #+BEGIN_EXAMPLE
   True
   False
   #+END_EXAMPLE

4. Given the following code
   #+NAME: person
   #+BEGIN_SRC haskell :eval never
   type Name = String
   type Age = Integer

   data Person = Person Name Age deriving Show

   :{
   data PersonInvalid = NameEmpty
                      | AgeTooLow
                      | PersonInvalidUnknown String
                      deriving (Eq, Show)
   :}

   :{
   mkPerson :: Name -> Age -> Either PersonInvalid Person
   mkPerson name age
     | name /= "" && age > 0 = Right $ Person name age
     | name == "" = Left NameEmpty
     | not (age > 0) = Left AgeTooLow
     | otherwise =
         Left $ PersonInvalidUnknown $ "Name was: " ++ show name ++ " Age was: " ++ show age
   :}
   #+END_SRC

   Your job is to write the following function without modifying
   the code above.
   #+BEGIN_SRC haskell :eval never
   gimmePerson :: IO ()
   gimmePerson = undefined
   #+END_SRC

   - It should prompt the user for a name and age input.
   - It should attempt to construct a Person value using the name and
     age the user entered.
   - If it constructed a successful person, it should print "Yay!
     Successfully got a person: " followed by the Person value.
   - If it got an error value, report that an error occurred and print
     the error.

   (Load the following code with ~C-c C-c~ in the REPL and then in the
   REPL call ~gimmePerson~)

   #+BEGIN_SRC haskell :results none
   import Text.Read (readMaybe)
   import System.IO (hSetBuffering, BufferMode (NoBuffering), stdout)

   <<person>>

   :{
   gimmePerson :: IO ()
   gimmePerson = do
     hSetBuffering stdout NoBuffering
     putStr "Person name: "
     name <- getLine
     putStr "Person age: "
     maybeAge <- getLine
     case readMaybe maybeAge :: Maybe Integer of
       Nothing ->
         putStrLn $ "error: `" ++ maybeAge ++ "` is not a number"
       (Just age) ->
         case mkPerson name age of
           (Left NameEmpty) ->
             putStrLn "error: the person name cannot be empty"
           (Left AgeTooLow) ->
             putStrLn "error: the person age cannot be too low"
           (Left (PersonInvalidUnknown reason)) ->
             putStrLn $ "error: " ++ reason
           (Right person) ->
             putStrLn $ "Yay! Successfully got a person: " ++ (show person)
   :}
   #+END_SRC
